In [2]:
import pandas as pd
import numpy as np

In [12]:
df1 =pd.DataFrame({
    "A":["A1","A2","A3","A4"],
    "B":["B1","B2","B3","B4"],
    "Ortak":["K1","K2","K3","K4"]
      })

df2 =pd.DataFrame({
    "C":["C1","C2","D3"],
    "D":["D1","D2","C3"],
    "Ortak":["K3","K4","K5"]
      })

In [13]:
df1

    A   B Ortak
0  A1  B1    K1
1  A2  B2    K2
2  A3  B3    K3
3  A4  B4    K4

In [14]:
df2

    C   D Ortak
0  C1  D1    K3
1  C2  D2    K4
2  D3  C3    K5

In [15]:
pd.merge(df1,df2) #İki veri setinindeki sütunlara bakar ve aynı verilere sahip olanları getirir.

    A   B Ortak   C   D
0  A3  B3    K3  C1  D1
1  A4  B4    K4  C2  D2